from cmath import nan

import pytest

@pytest.fixture()
def my_dict():
    return {
        'Статус': ['Готов', 'В работе', 'В очереди'],
        'Номер': [1, 2, 3],
        'Источник': ['Зал', 'Телефон', 'Онлайн']
    }

@pytest.fixture()
def my_dict_transactions():
    return {
        "Дата операции": ['31.12.2021 15:44:39', '02.05.2018 16:26:23', '03.06.2020 10:42:57', '04.11.2019 13:38:21'],
        "Сумма операции": [1.2, -2.3, -3.4, 4.3],
        "Статус": ['OK', 'OK', 'FAILED', 'OK'],
        "Описание": ['топ', 'мидл', 'лоу', 'хайт'],
        "Категория": ['товар', nan, 'перевод', 'товар'],
        "Номер карты": ['*4556', '*7197', '*4556', '*7197']
    }

@pytest.fixture()
def my_dick_settings():
    return {
        'user_currencies': ['EUR'],
        'user_stocks': ['AMZN']
    }

